---
title: "Irreducible-ideal"
format: html
editor: visual
execute: 
  echo: false
---

## Definition

Let $S$ be a [numerical semigroup](./Basic-concepts/Numerical-semigroup.qmd) and $E$ a [proper ideal](Proper-ideal.qmd) of $S$. It is said that $E$ is irreducible if it cannot be expressed as finite intersection of proper ideals of $S$ strictly containing it.

If $D(X)$ denotes the [set of divisors of x](./Basic-concepts/Set-divisors.qmd) in $S$, it can be proven that every irreducible ideal containing $E$ is of the form $S \setminus D(x)$, with $x \in S \setminus E$ and the intersection of all this sets is equal to $E$.

## Examples

$\circ$ Any numerical semigroup $S$ is irreducible as ideal of itself.

$\circ$ Let $S = \langle 3, 5, 7 \rangle = \{0, 3, 5, \rightarrow \}$, $I = \{3, 5\}$ and $E = I + S$. First, we compute $S \setminus E$,

$$
E = I + S = (3 + S) \cup (5 + S) = \{3, 6, 8, \rightarrow \} \cup \{5, 8, 10, \rightarrow \} = \{3, 5, 6, 8, \rightarrow \}.
$$

Therefore, $S \setminus E = \{0, 7\}$ and $E \subseteq (S \setminus D(0)) \cap (S \setminus D(7))$, but $S \setminus D(0) = S^*$ and $S \setminus D(7) = E$, then $E$ is a irreducible ideal of $S$.

## Examples with GAP

The following example is made with the package NumericalSgps in GAP.

$\diamond$ Let $S = \langle 9, 11, 14, 20 \rangle, I = \{20, 27, 33\}$ and $E = I + S$, in GAP:

```{GAP}

gap> S := NumericalSemigroup(9, 11, 14, 20);

<Numerical semigroup with 4 generators>

gap> I := [20, 27, 33];

[ 20, 27, 33 ]

gap> K := I + S;

<Ideal of numerical semigroup>


```

The function `Difference` has as parameters two ideals $I,J$ of a numerical semigroup with $J \subset I$ and returns $I \setminus J$, in this case, we need to compute $S \setminus E$.

```{GAP}

gap> Difference(0+S, K);

[ 0, 9, 11, 14, 18, 22, 23, 25, 28, 32, 37, 39, 46 ]

```

Then, $E = \bigcap_{x \in S \setminus E} (S \setminus D(x))$. It is known that there exist for every proper ideal a irredundant decomposition into proper irreducible ideals, the function `DecomposeIntegralIdealIntoIrreducibles` returns a list with the irreducible components.

```{GAP}

gap> DecomposeIntegralIdealIntoIrreducibles(K);

[ <Ideal of numerical semigroup>, <Ideal of numerical semigroup>, <Ideal of numerical semigroup> ]

gap> List(DecomposeIntegralIdealIntoIrreducibles(K),MinimalGenerators);

[ [ 9, 14, 33 ], [ 9, 22 ], [ 11, 27 ] ]


```

Turns out that actually $E = ( S \setminus D(22) ) \cap ( S \setminus D(39) ) \cap ( S \setminus D(46) )$, lets check it. The function `DivisorsOfElementInNumericalSemigroup` compute the set $D(x)$.

```{GAP}

gap> D1 := DivisorsOfElementInNumericalSemigroup(22,S);

[ 0, 11, 22 ]

gap> D2 := DivisorsOfElementInNumericalSemigroup(39,S);

[ 0, 11, 14, 25, 28, 39 ]


gap> D3 := DivisorsOfElementInNumericalSemigroup(46,S);

[ 0, 9, 14, 18, 23, 28, 32, 37, 46 ]


```

Once we have $D(22), D(39)$ and $D(46)$, the function `IdealByDivisorClosedSet` allows to compute $S \setminus D(x)$.

```{GAP}
gap> DifD1 := IdealByDivisorClosedSet(D1,S);

<Ideal of numerical semigroup>

gap> DifD2 := IdealByDivisorClosedSet(D2,S);


<Ideal of numerical semigroup>

gap> DifD3 := IdealByDivisorClosedSet(D2,S);


<Ideal of numerical semigroup>

gap> DifD3 := IdealByDivisorClosedSet(D3,S);

<Ideal of numerical semigroup>


```

Finally, the function `Intersection` computes the intersection of ideals of a numerical semigroup.

```{GAP}

gap> K = Intersection(DifD1, DifD2, DifD3);

true


```

## References
