---
title: "Reduction number"
format: html
editor: visual
execute: 
  echo: false
---

## Definition

Let $S$ be a [numerical semigroup](./Basic-concepts/Numerical-semigroup.qmd) and $E$ a [proper ideal](Proper-ideal.qmd) of $S$ with [multiplicity]() $m(E)$. It is defined the reduction number of $E$, denoted by $r(E)$, as the value

$$
r(E) = \min \{h \ge 1 ~ | ~ (h+1)E = m(E) + hE \}.
$$

A proper ideal is said to be [stable](Stable-ideal.qmd) if $r(E) = 1$, that is, $2E = m(E) + E$.

## Examples

$\circ$ Let $S = \langle 3, 5, 7 \rangle$, $I = \{2, 4\}$ and $E = I + S = \{2, 4, 5, 7, \rightarrow \}$. Clearly, $m(E) = 2$, then we are looking for the smaller $h \in \mathbb{N} \setminus \{0\}$ such that $(h+1)E = 2 + hE$. If we take $h = 1$,

$$
2E = E + E = \{4, 6, \rightarrow\} \ne \{4, 6, 7, 9, \rightarrow \} = 2 + E.
$$

For $h = 2$,

$$
3E = (E + E) + E = \{6, 8, \rightarrow\} = 2 + 2E
$$

To sum up, $r(E) = 2$.

## Examples with GAP

The following example is made with the package NumericalSgps in GAP.

$\diamond$ Let $S = \langle 11, 14, 20 \rangle$, $I = \{22, 45, 53\}$ and $K = I + S$, in GAP:

```{GAP}

gap> S := NumericalSemigroup(11, 14, 20);

<Numerical semigroup with 3 generators>

gap> I := [22, 45, 53];

[ 22, 45, 53 ]

gap> K := I + S;

<Ideal of numerical semigroup>

  
```

The function `ReductionNumber` returns the reduction number of a proper ideal.

```{GAP}

gap> ReductionNumber(K);

2

```

Then, $3K = m(K) + 2K$, lets check it. The function `Minimum` returns the multiplicity of a relative ideal, then,

```{GAP}

gap> Minimum(K);

22

gap> 3*K = 22 + 2*K;

true


```

If we prove with $h = 1$,

```{GAP}

gap> 2*K = 22 + K;

false

```

## References
