---
title: "Standard canonical ideal"
format: html
editor: visual
execute: 
  echo: false
---

## Definition

Let $S$ be a [numerical semigroup](./Basic-concepts/Numerical-semigroup.qmd) and $F(S)$ the [Frobenius number](./Basic-concepts/Frobenius-number.qmd) of $S$. The standard canonical ideal of $S$ is defined as

$$
K(S) = \{x \in \mathbb{Z} ~ | ~ F(S) - x \not \in S\}.
$$ It is easy to verify that the standard canonical ideal is a relative ideal of $S$ and $S \subseteq K(S) \subseteq \mathbb{N}$.

## Examples

$\circ$ Let $S = \langle 4, 9, 10 \rangle = \{0, 4, 8, 9, 10, 12, 13, 14, 16, \rightarrow \}$. The Frobenius number of $S$ is $F(S) = 15$, thus $K(S) = \{x \in \mathbb{Z} ~ | ~ 15 - x \not \in S\}$. The set of [gaps](./Basic-concepts/Gap.qmd) of $S$ is $G(S) = \{1, 2, 3, 5, 6, 7, 11, 15\}$, then if we compute $15 -g$ for every $g \in G(S)$, we have that $K(S) = S \cup \{4, 8, 9, 10, 12, 13, 14\} = \{0, 4, 8, 9, 10, 12, 13, 14, 16, \rightarrow \} = S$. It can be proven that $S = K(S)$ if, and only if, $S$ is [symmetric](./Families-NS/NS-symmetric.qmd).

## Examples with GAP

The following example is made with the package NumericalSgps in GAP.

$\diamond$ Let $S = \langle 5, 7, 13, 16 \rangle$, in GAP:

```{GAP}
gap> S := NumericalSemigroup(5, 7, 13, 16);

<Numerical semigroup with 4 generators>

```

To compute the canonical ideal of $S$, there is the functions `CanonicalIdeal` and `CanonicalIdealOfNumericalSemigroup`, which both returns the canonical ideal of the numerical semigroup.

```{GAP}

gap> K := CanonicalIdeal(S);

<Ideal of numerical semigroup>

```

On the other hand, given an ideal $E$ of a numerical semigroup $S$, the functions `IsCanonicalIdeal` and `IsCanonicalIdealOfNumericalSemigroup` returns true or false whether the ideal $E$ is a translation of the canonical ideal.

```{GAP}
gap> IsCanonicalIdeal(K);

true

gap> K2 := 3 + K;

<Ideal of numerical semigroup>

gap> IsCanonicalIdeal(K2);

true



```

## References
