---
title: "Genus"
format: html
editor: visual
execute: 
  echo: false
---

## Definition

Let $S$ be a [numerical semigroup](Numerical-semigroup.qmd). By definition of numerical semigroup, the set $\mathbb{N} \setminus S$, usually denoted by $G(S)$, is finite, then the genus of $S$, denoted by $g(S)$, is defined as $g(S) = |\mathbb{N} \setminus S|$.

If $n(S)$ is the cardinal of the set formed by the [left elements](Left-elements) of $S$, and $C(S)$ is the [conductor](Conductor.qmd) of $S$, it is easy to see the relation $n(S) + g(S) = C(S)$.

## Examples

$\circ$ Let $S = \langle 6, 10, 13, 14, 15 \rangle$. Computing the first elements of $S$, we can note that $S = \{ 0, 6, 10, 12, 13, 14, 15, 16, 18, \rightarrow \}$, and then $\mathbb{N} \setminus S = \mathbb{N} \setminus \{0, 6, 10, 12, 13, 14, 15, 16, 18\} = \{1, 2, 3, 4, 5, 7, 8, 9, 11, 17\}$, thus $g(S) = 10$.

$\circ$ Let $S = \{ 0, 4, 8, 9, 11, 12, 13, 15, \rightarrow \}$. The set of left elements is $N(S) = \{0, 4, 8, 9, 11, 12, 13\}$ and the conductor is $F(S) = 15$, therefore $g(S) = C(S) - n(S) = 15 - 7 = 8$.

## Examples with GAP

The following examples are made with the package NumericalSgps in GAP.

$\diamond$ Let $S = \langle 8, 11, 13, 15, 19 \rangle$, in GAP:

```{GAP}
gap> S := NumericalSemigroup(8, 11, 13, 15, 19);

<Numerical semigroup with 5 generators>

```

In order to compute the genus of $S$, we can apply the function `Genus`.

```{GAP}
gap> Genus(S);

15
```

$\diamond$ Let $S = \langle 6, 8, 10, 13 \rangle$, in GAP:

```{GAP}
gap> S := NumericalSemigroup(6, 8, 10, 13);

<Numerical semigroup with 4 generators>

```

We will use the relation $g(S) = C(S) - n(S)$ to compute the genus. First, we use the function `SmallElements` to calculate the set $N(S) \cup \{C(S)\}$.

```{GAP}
gap> SmallElements(S);
  
[ 0, 6, 8, 10, 12, 13, 14, 16, 18 ]

```

Then, we get $C(S) = 18$ and $n(S) = |\{0, 6, 8, 10, 12, 13, 14, 16 \}| = 8$, so $g(S) = C(S) - n(S) = 10$. Applying the function `Genus`:

```{GAP}
gap> Genus(S);

10
```

## References
