---
title: "Relation order of a numerical semigroup"
format: html
engine: markdown
---

## Definition

Let $S$ be a [numerical semigroup](Numerical-semigroup.qmd). It is defined the relation $\le_S$ over $\mathbb{Z}$ as follows:

$$
a \le_S b \Longleftrightarrow b - a \in S.
$$

It can be proven that $\le_S$ is a partial order relation. From this relation order is possible to characterize the [pseudo-Frobenius numbers](Pseudo-Frobenius-number.qmd) of $S$.

## Examples

$\circ$ Let $S = \langle 10, 14, 17, 21 \rangle$ and the integers $x_1 = 8, x_2 = 62$. For $x_1$, there is no positive integer $y \ne x_1$ such that $y \le_S x_1$, since $x_1 - y = 8 - y < 10$ and the only element in $S$ smaller than $10$ is $0$, therefore $x_1$ is a minimal in $\mathbb{N}$, but is not minimal in $\mathbb{Z}$, since $-2 \le_S x_1$. On the other hand, for $x_2 = 62$ we have that $10 \le_S 62$ and $62 \le_S 72$.

$\circ$ Let $S$ be a numerical semigroup and let $F(S)$ be the [Frobenius number](Frobenius-number.qmd) of $S$. If we suppose that $F(S) \le_S x$ for some $x \in \mathbb{Z} \setminus S$, then there exists $s \in S$ such that $x = F(S) + s$, but that means $x \in S$, which is a contradiction. Therefore, $F(S)$ is maximal in $\mathbb{Z} \setminus S$.

## Examples with GAP

Nowadays, there are no functions in package NumericalSgps related to dominant of a numerical semigroup. However, given a numerical semigroup and two integers $a,b \in \mathbb{Z}$, the following function in GAP returns true if $a \le_S b$ and false otherwise.

``` gap
gap> AreRelatedNumericalSemigroup := function(S,a,b)
>       if IsNumericalSemigroup(S) = false then
>               return "First parameter must be a Numerical Semigroup";
>       fi;
>       if (b-a) in S then
>               return true;
>       else
>               return false;
>       fi;
> end;
function( S, a, b ) ... end
```

$\diamond$ Let $S = \langle 18, 22, 25, 30 \rangle$, in GAP:

``` gap
gap> S := NumericalSemigroup(18, 22, 25, 30);
<Numerical semigroup with 4 generators>
```

Since $95 - 65 = 30 \in S$, the function should return `true`, and since $22 - 18 = 4 \not \in S$, the function should return false. If we try it,

``` gap
gap> AreRelatedNumericalSemigroup(S, 65, 95);
true
gap> AreRelatedNumericalSemigroup(S, 18, 22);
false
gap> AreRelatedNumericalSemigroup(18, S, 22);
"First parameter must be a Numerical Semigroup"
```

## References

<!-- https://docs.gap-system.org/doc/tut/chap4_mj.html#X801EE07E839B31B2 -->
